/*Напишите программу, в которой используются две переменные логического типа (boolean),
 присвойте им значения и выведете для каждой переменной на экран строку "истина",
 если переменная имеет значение true и "ложь", если переменная имеет значение false.*/

package lesson1_homework;


public class TASK12 {
    public static void main(String[] args) {
       boolean a = true, b = false;
        if (a == true ) System.out.println("a" + " Истина");
        if (a == false) System.out.println("a" + " Ложь");
        if (b == true ) System.out.println("b" + " Истина");
        if (b == false) System.out.println("b" + " Ложь");
    }
}



