/*Напишите программу с тремя переменными целого типа, первым двум присвойте значения,
        а третьей переменной присвойте их сумму. Выведете значение третей переменной на экран.*/

package lesson1_homework;


public class TASK10 {
    public static void main(String[] args) {
       int a = 10, b = 20, sum;
        System.out.println("Cумма а + b = " + (sum = a + b));
    }
}



