/*Напишите программу с тремя переменными целого типа, первым двум присвойте значения,
 а третьей переменной присвойте их сумму. Выведете значение третей переменной на экран.*/

package lesson1_homework;


public class TASK11 {
    public static void main(String[] args) {
       int a = 10, b = 70, c = 52;
        System.out.println(Math.max(Math.max(a, b), c));
    }
}



